assignment-16.org
# -*- fill-column: 80; org-confirm-babel-evaluate: nil -*-

#+TITLE:     Assignment 16, Introduction To Mathematics
#+AUTHOR:    Oleg Sivokon
#+EMAIL:     olegsivokon@gmail.com
#+DATE:      <2015-01-17 Sat>
#+DESCRIPTION: Sixth asssignment in the course Introduction To Mathematics
#+KEYWORDS: Introduction To Mathematics, Assignment, Set Theory
#+LANGUAGE: en
#+LaTeX_CLASS: article
#+LATEX_HEADER: \usepackage[usenames,dvipsnames]{color}
#+LATEX_HEADER: \usepackage[backend=bibtex, style=numeric]{biblatex}
#+LATEX_HEADER: \usepackage{commath}
#+LATEX_HEADER: \usepackage{tikz}
#+LATEX_HEADER: \usetikzlibrary{shapes,backgrounds}
#+LATEX_HEADER: \usepackage{marginnote}
#+LATEX_HEADER: \usepackage{listings}
#+LATEX_HEADER: \usepackage{color}
#+LATEX_HEADER: \usepackage{enumerate}
#+LATEX_HEADER: \hypersetup{urlcolor=blue}
#+LATEX_HEADER: \hypersetup{colorlinks,urlcolor=blue}
#+LATEX_HEADER: \addbibresource{bibliography.bib}
#+LATEX_HEADER: \setlength{\parskip}{16pt plus 2pt minus 2pt}
#+LATEX_HEADER: \definecolor{codebg}{rgb}{0.96,0.99,0.8}
#+LATEX_HEADER: \definecolor{codestr}{rgb}{0.46,0.09,0.2}

#+BEGIN_SRC emacs-lisp :exports none
(setq org-latex-pdf-process
        '("latexmk -pdflatex='pdflatex -shell-escape -interaction nonstopmode' -pdf -bibtex -f %f")
        org-latex-listings t
        org-src-fontify-natively t
        org-babel-latex-htlatex "htlatex")
(defmacro by-backend (&rest body)
    `(cl-case (when (boundp 'backend) (org-export-backend-name backend))
       ,@body))
#+END_SRC

#+RESULTS:
: by-backend

#+BEGIN_LATEX
  \lstset{ %
    backgroundcolor=\color{codebg},
    basicstyle=\ttfamily\scriptsize,
    breakatwhitespace=false,         % sets if automatic breaks should only happen at whitespace
    breaklines=false,
    captionpos=b,                    % sets the caption-position to bottom
    commentstyle=\color{mygreen},    % comment style
    framexleftmargin=10pt,
    xleftmargin=10pt,
    framerule=0pt,
    frame=tb,                        % adds a frame around the code
    keepspaces=true,                 % keeps spaces in text, useful for keeping indentation of code (possibly needs columns=flexible)
    keywordstyle=\color{blue},       % keyword style
    showspaces=false,                % show spaces everywhere adding particular underscores; it overrides 'showstringspaces'
    showstringspaces=false,          % underline spaces within strings only
    showtabs=false,                  % show tabs within strings adding particular underscores
    stringstyle=\color{codestr},     % string literal style
    tabsize=2,                       % sets default tabsize to 2 spaces
  }
#+END_LATEX

\clearpage

* Problems

** Problem 1
   Given a system of axioms concerning ``points'', ``lines'' and a relation
   ``on'' /(point on a line)/:

   1. Given two distinct points $A$ and $B$, and two distinct lines $\ell_1$
      and $\ell_2$ such that $A$ and $B$ are on both of them.
   2. For every line $\ell$ there is a point $P$ which is not on $\ell$.
      + Prove that the system is consistent.
      + Prove that the system is not categorical.
      + Prove that the system is independant.
      + Prove that the system entails theorem ``There exist at least four points''.

*** Answer 1
    In order to show consistency it is enough to find a model for the system.
    Let's find such a model.  If I consider lines as sets, then I can imagine
    a system with lines $\ell_1=\{A,B,P_1\}$ and $\ell_2=\{A,B,P_2\}$.
    By construction points $A,B$ are on both
    $\ell_1$ and $\ell_2$, $P_1 \not \in \ell_2$ and $P_2 \not \in \ell_1$.
    This satisfies both axioms, hence the model is consistent.

*** Answer 2
    In order to show that the system is not categorical I need to find at least
    two models not isomorphic to each other.  Observe that we can easily extend
    the model given in [[Answer 1]] by appending points to either of two lines
    without violating any of the two axioms.  Thus, for example, a model
    $\ell_1=\{A,B,P_1,P_3\},\ell_2=\{A,B,P_2\}$ would still satisfy both axioms
    but would not be isomorphic to the system I extended because the first one
    didn't have point $P_3$ in it.

*** Answer 3
    To show independence, I need to find such models where one of the axioms
    in the system in question doesn't hold, but other do.  An example of such
    system could be modeled using the model from the [[Answer 1]] with a line $\ell_3$
    appended to it such that $\ell_3=\{A,B,P_1,P_2\}$.  This would allow for
    the first axiom to hold, while the second axiom would be violated (as there
    would be no points that are not on $\ell_3$.

*** Answer 4
    I am given at least two points by definition, now I need to establish that
    there must be at least two more.  Observe that it is required by the second
    axiom that there be a point $P$ not on some line.  Neither $A$ nor $B$ can
    satisfy this condition, since both of them are on both lines, thus there
    must be at least one more point for both $\ell_1$ and $\ell_2$ (since these
    are the only lines warranted to exist by the first axiom).  Thus we have
    that there will be at least four points in this system.

** Problem 2
   Given the system of axioms which defins ``point'', ``line'', an ``on''
   relation and axioms:
   1. There are at least two lines.
   2. There are exactly seven points.
   3. There are exactly three points on each line.
   4. For every two lines there's exactly one point that is on both of them.
      + Prove that the system is consistent.
      + Prove that the system is independent.
      + Prove or disporve the statement: the system is categorical.
   Given following axioms:
   5. Every two points are on one and only line.
   6. Every three points are on one and only line.
      
   For axioms 5 and 6, prove or disprove: after appending either one of them
   to the original system, the system will remain consistent.

*** Answer 5
    To prove consistency I will need to show a model for the system.  I will
    start by naming the points: $A,B,C,D,E,F,G$.  Suppose now, I built four
    three lines: $\ell_1=\{A,B,C\}$, $\ell_2=\{A,D,E\}$, $\ell_3=\{B,D,F\}$,
    $\ell_4=\{C,D,G\}$.
    
    First axiom holds since there are at least two lines (four actually).
    Second axiom holds since there are exactly seven points.  Third axiom
    holds since ther are exactly three points on each line.  Fourth axiom
    holds since there is exactly one point where each two lines intersect.
    Let's list them in a table:

    |   |          | $\ell_1$ | $\ell_2$ | $\ell_3$ | $\ell_4$ |
    |---+----------+----------+----------+----------+----------|
    | / | >        |          |          |          |          |
    |   | $\ell_1$ |          |          |          |          |
    |   | $\ell_2$ | $A$      |          |          |          |
    |   | $\ell_3$ | $B$      | $D$      |          |          |
    |   | $\ell_4$ | $C$      | $D$      | $D$      |          |

    /(note that we only need to fill half the table, since it's symmetrical)/

*** Answer 6
    To prove independence, I need to show a model that is inconsisten with
    all modles, but is consistent with the system lacking either one of the
    axioms.  First axiom warrants us the existence of lines, if it wasn't
    for the first axiom, the system could have no lines, and all other
    axioms would hold vacuously.  If we haven't been given that thre must
    be exactly seven points, we could construct a system which would have
    fewer points but satisfy all other conditions, for example:
    $\ell_1=\{A,B,C\},\ell_2=\{C,D,E\}$, which has at least two lines,
    exactly three points on each line and $C$ is the only line where $\ell_1$
    and $\ell_2$ intersect.  If we remove the fourth axiom, then we could
    build a model, where some lines don't intersect, for example:
    $\ell_1=\{A,B,C\},\ell_2=\{C,D,E\},\ell_3=\{E,F,G\}$.

    Since I've tried to remove every axiom and was able to build a model
    inconsistent with the removed axiom, but consistent with the rest, the
    system must be independent.

