assignment-16.tex
% Created 2015-01-17 Sat 23:36
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage[utf8]{inputenc}
\usepackage[usenames,dvipsnames]{color}
\usepackage[backend=bibtex, style=numeric]{biblatex}
\usepackage{commath}
\usepackage{tikz}
\usetikzlibrary{shapes,backgrounds}
\usepackage{marginnote}
\usepackage{listings}
\usepackage{color}
\usepackage{enumerate}
\hypersetup{urlcolor=blue}
\hypersetup{colorlinks,urlcolor=blue}
\addbibresource{bibliography.bib}
\setlength{\parskip}{16pt plus 2pt minus 2pt}
\definecolor{codebg}{rgb}{0.96,0.99,0.8}
\definecolor{codestr}{rgb}{0.46,0.09,0.2}
\author{Oleg Sivokon}
\date{\textit{<2015-01-17 Sat>}}
\title{Assignment 16, Introduction To Mathematics}
\hypersetup{
  pdfkeywords={Introduction To Mathematics, Assignment, Set Theory},
  pdfsubject={Sixth asssignment in the course Introduction To Mathematics},
  pdfcreator={Emacs 25.0.50.1 (Org mode 8.2.2)}}
\begin{document}

\maketitle
\tableofcontents


\lstset{ %
  backgroundcolor=\color{codebg},
  basicstyle=\ttfamily\scriptsize,
  breakatwhitespace=false,         % sets if automatic breaks should only happen at whitespace
  breaklines=false,
  captionpos=b,                    % sets the caption-position to bottom
  commentstyle=\color{mygreen},    % comment style
  framexleftmargin=10pt,
  xleftmargin=10pt,
  framerule=0pt,
  frame=tb,                        % adds a frame around the code
  keepspaces=true,                 % keeps spaces in text, useful for keeping indentation of code (possibly needs columns=flexible)
  keywordstyle=\color{blue},       % keyword style
  showspaces=false,                % show spaces everywhere adding particular underscores; it overrides 'showstringspaces'
  showstringspaces=false,          % underline spaces within strings only
  showtabs=false,                  % show tabs within strings adding particular underscores
  stringstyle=\color{codestr},     % string literal style
  tabsize=2,                       % sets default tabsize to 2 spaces
}

\clearpage

\section{Problems}
\label{sec-1}

\subsection{Problem 1}
\label{sec-1-1}
Given a system of axioms concerning ``points'', ``lines'' and a relation
``on'' \emph{(point on a line)}:

\begin{enumerate}
\item Given two distinct points $A$ and $B$, and two distinct lines $\ell_1$
and $\ell_2$ such that $A$ and $B$ are on both of them.
\item For every line $\ell$ there is a point $P$ which is not on $\ell$.
\begin{itemize}
\item Prove that the system is consistent.
\item Prove that the system is not categorical.
\item Prove that the system is independant.
\item Prove that the system entails theorem ``There exist at least four points''.
\end{itemize}
\end{enumerate}

\subsubsection{Answer 1}
\label{sec-1-1-1}
In order to show consistency it is enough to find a model for the system.
Let's find such a model.  If I consider lines as sets, then I can imagine
a system with lines $\ell_1=\{A,B,P_1\}$ and $\ell_2=\{A,B,P_2\}$.
By construction points $A,B$ are on both
$\ell_1$ and $\ell_2$, $P_1 \not \in \ell_2$ and $P_2 \not \in \ell_1$.
This satisfies both axioms, hence the model is consistent.
\subsubsection{Answer 2}
\label{sec-1-1-2}
In order to show that the system is not categorical I need to find at least
two models not isomorphic to each other.  Observe that we can easily extend
the model given in \ref{sec-1-1-1} by appending points to either of two lines
without violating any of the two axioms.  Thus, for example, a model
$\ell_1=\{A,B,P_1,P_3\},\ell_2=\{A,B,P_2\}$ would still satisfy both axioms
but would not be isomorphic to the system I extended because the first one
didn't have point $P_3$ in it.
\subsubsection{Answer 3}
\label{sec-1-1-3}
To show independence, I need to find such models where one of the axioms
in the system in question doesn't hold, but other do.  An example of such
system could be modeled using the model from the \ref{sec-1-1-1} with a line $\ell_3$
appended to it such that $\ell_3=\{A,B,P_1,P_2\}$.  This would allow for
the first axiom to hold, while the second axiom would be violated (as there
would be no points that are not on $\ell_3$.
\subsubsection{Answer 4}
\label{sec-1-1-4}
I am given at least two points by definition, now I need to establish that
there must be at least two more.  Observe that it is required by the second
axiom that there be a point $P$ not on some line.  Neither $A$ nor $B$ can
satisfy this condition, since both of them are on both lines, thus there
must be at least one more point for both $\ell_1$ and $\ell_2$ (since these
are the only lines warranted to exist by the first axiom).  Thus we have
that there will be at least four points in this system.
\subsection{Problem 2}
\label{sec-1-2}
Given the system of axioms which defins ``point'', ``line'', an ``on''
relation and axioms:
\begin{enumerate}
\item There are at least two lines.
\item There are exactly seven points.
\item There are exactly three points on each line.
\item For every two lines there's exactly one point that is on both of them.
\begin{itemize}
\item Prove that the system is consistent.
\item Prove that the system is independent.
\item Prove or disporve the statement: the system is categorical.
\end{itemize}
\end{enumerate}
Given following axioms:
\begin{enumerate}
\item Every two points are on one and only line.
\item Every three points are on one and only line.
\end{enumerate}

For axioms 5 and 6, prove or disprove: after appending either one of them
to the original system, the system will remain consistent.

\subsubsection{Answer 5}
\label{sec-1-2-1}
To prove consistency I will need to show a model for the system.  I will
start by naming the points: $A,B,C,D,E,F,G$.  Suppose now, I built four
three lines: $\ell_1=\{A,B,C\}$, $\ell_2=\{A,D,E\}$, $\ell_3=\{B,D,F\}$,
$\ell_4=\{C,D,G\}$.

First axiom holds since there are at least two lines (four actually).
Second axiom holds since there are exactly seven points.  Third axiom
holds since ther are exactly three points on each line.  Fourth axiom
holds since there is exactly one point where each two lines intersect.
Let's list them in a table:

\begin{center}
\begin{tabular}{l|llll}
 & $\ell_1$ & $\ell_2$ & $\ell_3$ & $\ell_4$\\
\hline
$\ell_1$ &  &  &  & \\
$\ell_2$ & $A$ &  &  & \\
$\ell_3$ & $B$ & $D$ &  & \\
$\ell_4$ & $C$ & $D$ & $D$ & \\
\end{tabular}
\end{center}

\emph{(note that we only need to fill half the table, since it's symmetrical)}
\subsubsection{Answer 6}
\label{sec-1-2-2}
To prove independence, I need to show a model that is inconsisten with
all modles, but is consistent with the system lacking either one of the
axioms.  First axiom warrants us the existence of lines, if it wasn't
for the first axiom, the system could have no lines, and all other
axioms would hold vacuously.  If we haven't been given that thre must
be exactly seven points, we could construct a system which would have
fewer points but satisfy all other conditions, for example:
$\ell_1=\{A,B,C\},\ell_2=\{C,D,E\}$, which has at least two lines,
exactly three points on each line and $C$ is the only line where $\ell_1$
and $\ell_2$ intersect.  If we remove the fourth axiom, then we could
build a model, where some lines don't intersect, for example:
$\ell_1=\{A,B,C\},\ell_2=\{C,D,E\},\ell_3=\{E,F,G\}$.

Since I've tried to remove every axiom and was able to build a model
inconsistent with the removed axiom, but consistent with the rest, the
system must be independent.
