assignment-16.org
*** Answer 7
    The system is categorical.  It has exactly seven points and all
    assignments of lines to these points are equivalent up to isomorphism.
    To prove this, suppose this was not the case.  Suppose there was
    an assignment of lines to points such that would be different from
    the one modeled in [[Answer 5]].  First, observe that this wouldn't have
    been possible to achieve with three lines, as this would require that
    provided there are three points on each line, either two of three lines
    don't intersect, or, there would be one spare point left.  To see
    why this is true, let's count the elements of three sets where each
    contains exactly three elements such that it shares one of the elements
    with the other set.  Since there are three of them, there must be two
    elements in each set that are shared with the other sets.  I.e. each
    set contains one element it doesn't share with anyone, and two elements
    it shares with each other set.  This, in turn gives us 3 non-shared
    elements, and three elements shared between pairs of sets.  Which is
    one element shy of the requirement.

    Observe also that this system cannot be modeled by five or more lines
    because five lines would require that lines with exactly three points
    intersect with every other four lines in exactly one point, which is
    not possible (by pigeonhole principle, some two lines would have to
    intersect in two points, or there would have to be more points in each
    line).

    With this out of the way, we can now limit our proof to only proving
    that any assignment of four lines to seven points with initial constraints
    will be isomorphic.  Obseve that without loss of generality, we could
    select any three points and draw a line through them.  Let these be
    $A$, $B$ and $C$ for the ease of reference.  We are now left with
    four points, we need to draw a line through each pair of these four
    points such that the third point would be then either $A$, $B$ or $C$.
    Combinations of two from four give us three, all of them equivalent
    choices.  These are also the only choices that we can make, since if
    we chose either three or one points from the $D,E,F,G$, then we will
    fail to satisfy either the requirement that all lines have a commont
    point or that that any two lines intersect in only one point.
    This gives us an assignment of lines to points unique up to renaming,
    which is another way of saying that the model is unique up to isomorphism.

*** Answer 8
    Every two points are on one and only line---this follows from the system
    in question.  Since we proved earlier that the system is categorical,
    we can use its model to prove simply by counting that every line has
    a combination of two unique points.

*** Answer 9
    If, however, we claimed that every three points are on one and only
    line, the system would've become inconsistent.  One way to see that
    is to, again, simply by looking at the model (and we are allowed to
    do so, since we know it's the only possible model).  Another way
    is to simply count the combinations of three out of seven without
    repetition.  This gives us that if this axiom was consistent with
    the system, there would have to be 35 lines, but we know ther to be
    only 4.  Thus it would be a contradiction.

** Problem 3
   Given the axioms of group which define ``element'' and ``binary operation''.
   1. Prove that the system is consistent.
   2. Prove that the second axiom is not derivable from the rest.
   3. Prove that the fourth axiom is not derivable from the rest.
   4. With added fifth axiom: ``there are exactly four elements'', 
      let $G$ be a set of functions $f,g,h,k : \{1,2,3,4\}\to\{1,2,3,4\}$
      defined as: $f$ is the identity function, $g(4)=4, g(3)=3, g(2)=1, g(1)=2$,
      $h(4)=3, h(3)=4, h(2)=1, h(1)=2$, $k=g \circ h$.
      Prove that $G$ with function composition operation models the system
      $(1,2,3,4,5)$.
   5. Prove that $(1,2,3,4,5)$ is not categorical.

*** Answer 10
    To prove consistency I need to show a model of the system.  Let's
    recal the axioms:
    + Closure :: the result of application of group operation to any two
      elements of the group is an element of the group.
    + Associativity :: the order of application of group operation doesn't
      matter.
    + Identity element :: there exists an element in the group, which,
      under group operation with any element of the group will give that
      same element.
    + Inverse :: for every group element there exists an element in the
      group which under group operation produces the identity element of
      that group.
      
    Integers under addition form a group, which is a model of any group,
    thus the system is consistent.

*** Answer 11
    I don't know which one is second, but I'll assume *associativity*.
    An example of a set with operation, which is closed, has identity element
    and has inverses one could consider matrix multiplication on the set
    of invertible matrices.  These will have inverses by construction,
    multiplication of any two invertible matrices is still an invertible matrix,
    the identity matrix is certainly the member of the set of all invertible
    matrices, but, in general, multiplication will not be associative.
    Thus, second axiom is not derivable from the rest.

*** Answer 12
    Again, I'll assume that the fourth axiom is the *inverse element*.
    An example of an operation on a set which has closure, associativity,
    identity element but not inverses is the set of natural numbers under
    multiplication.  1 is the identity element, associativy holds by the
    definition of multiplication and similarly for closure, however, in
    general, natural numbers don't have inverses under multiplication in
    the set of natural numbers.  (Only identity element has an inverse---itself).

*** Answer 13
    Let's prove $G$ is a group, since the fifth axiom holds trivially by
    construction.

    $G$ has identity element, again, by definition, it is $f$.  So,
    the *identity* axiom holds. Now, observe that under function composition
    $g \circ g = I$, $f \circ f = I$, $h \circ h = I$, $k \circ k = I$.
    This warrants us that every element has an *inverse* (itself).  By looking
    through all results of all functions, it is easy to see that none of the
    given functions never produces anything other than 1, 2, 3 or 4, so $G$
    is *closed* under function composition.

    In order to prove *associativity* I will have to build the operation
    table.  Given the table is symmetrical along its diagonal, the operation
    would have to be associative:

    |   |     | $f$         | $g$         | $h$         | $k$         |
    |---+-----+-------------+-------------+-------------+-------------|
    | / | >   |             |             |             |             |
    |   | $f$ | $(1,2,3,4)$ | $(2,1,3,4)$ | $(1,2,4,3)$ | $(2,1,4,3)$ |
    |   | $g$ | $(2,1,3,4)$ | $(1,2,3,4)$ | $(2,1,4,3)$ | $(1,2,4,3)$ |
    |   | $h$ | $(2,1,3,4)$ | $(2,1,4,3)$ | $(1,2,3,4)$ | $(2,1,3,4)$ |
    |   | $k$ | $(2,1,4,3)$ | $(1,2,4,3)$ | $(2,1,3,4)$ | $(1,2,3,4)$ |

    /(Note that the results are given as tuples, where order matters)/

    Since the table is symmetrical along its diagonal, the operation is associative.
    This completes the proof.

