assignment-16.tex
\subsection{Problem 4}
\label{sec-1-4}
Given system of axioms which defines ``point'', ``line'' and ``on''
relationship where:
\begin{enumerate}
\item There are exactly four points.
\item Every two points belong to the one and only line.
\item For every line $\ell$ and every point $P$, which is not on $\ell$
there exists the only line such that $P$ is on it and this (other)
line has no points in common with $\ell$.

\item Prove that the system is consistent.
\item Prove that the system isn't categorical.
\item Prove that the system is not complete, in other words, that there
exists a theorem, which, when added to the system doesn't make it
contradictory.
\item Prove that this system entails ``there doesn't exist a line which
has exactly three points on it.''
\end{enumerate}

\subsubsection{Answer 14}
\label{sec-1-4-1}
To prove consistency, I will demonstrate the model for this system.
One such model can be constructed from
$\ell_1=\{A,B\},\ell_2=\{B,C\},\ell_3=\{C,D\},\ell_4=\{D,A\},\ell_5=\{A,C\}\ell_6=\{B,D\}$.

(1) holds because there are exactly four points: $A,B,C$ and $D$.
(2) holds because every two points belong to distinct lines.
(3) holds because for $\ell_1$ there's $\ell_3$ which satisfies
the condition for $C$ and $D$, which are not on $\ell_1$, and,
symmetrically, for all lines other than $\ell_5$ and $\ell_6$.
$\ell_6$ satisfies third axiom using $\ell_5$ and points $D$ and $B$,
$\ell_5$ is symmetrical to $\ell_6$.
\subsubsection{Answer 15}
\label{sec-1-4-2}
To prove that the system isn't categorical, I will build a model
which also satisfies the three axioms, but is not isomorophic to
the model given in \ref{sec-1-4-1}.  The model is very simple:
$\ell=\{A,B,C,D\}$.

(1) holds by construction.
(2) holds since any two points are on $\ell$ (there are no other
lines they can belong to).
(3) holds vacuously since there are no points which are not on $\ell$,
we are allowed to conclude that the condition is satisfied.
\subsubsection{Ansswer 16}
\label{sec-1-4-3}
There could be plenty of axioms added to this system such that they
will neither derive from the rest nor contradict the rest.  As
seen in \ref{sec-1-4-2} I could add a requirement that there be only
one line.  Since in the \ref{sec-1-4-1} I just demonstrated a model which
is consistent with the original model, but is inconsistent with
the new model, the added axiom is independentent of the first three.
The argument for consistency was given in \ref{sec-1-4-2}.
\subsubsection{Answer 17}
\label{sec-1-4-4}
In order to prove that the statement is not entailed by the system I
will add this statement to the system, and will prove inconsistency.

So, suppose there was line with exactly three points.  Without loss of
generality, let's name these points $A$, $B$ and $C$.  The remaining
point $D$ would, by the third axiom require that we be able to draw a line
through it, which has no common points with $\ell$ ($\ell=\{A,B,C\}$).
But we are also given that every two ponts must be on a line.  So, $D$
must be on a line with some other point.  Since we are given that there
are only four of them, we are left with just three choices, and all of
them are on $\ell$.  Thus $D$ must be on $\ell$.  But, by assumption,
$D$ is not on $\ell$.  This is a contradiction, hence system with
the fourth axiom added is inconsistent, hence it does not entail it.
% Emacs 25.0.50.1 (Org mode 8.2.2)
\end{document}